{
    "version": "https://jsonfeed.org/version/1",
    "title": "asaphyuan.com",
    "description": "",
    "home_page_url": "https://asaphy.github.io/gh-pages",
    "feed_url": "https://asaphy.github.io/gh-pages/feed.json",
    "user_comment": "",
    "author": {
        "name": "Asaph Yuan"
    },
    "items": [
        {
            "id": "https://asaphy.github.io/gh-pages/on-giving.html",
            "url": "https://asaphy.github.io/gh-pages/on-giving.html",
            "title": "On Giving",
            "summary": "Hey church fam, 1 Tim 6:17-19 17 Command those who are rich&hellip;",
            "content_html": "<p>Hey church fam,</p>\n<p>1 Tim 6:17-19<br>17 Command those who are rich in this present world not to be arrogant nor to put their hope in wealth, which is so uncertain, but to put their hope in God, who richly provides us with everything for our enjoyment. 18 Command them to do good, to be rich in good deeds, and to be generous and willing to share. 19 In this way they will lay up treasure for themselves as a firm foundation for the coming age, so that they may take hold of the life that is truly life.</p>\n<p>3 things I want to point out here:</p>\n<p>1. Our hope is either in wealth or in God, as Jesus mentions on the Sermon on the Mount, we cannot serve 2 masters.</p>\n<p>2. We are commanded to be generous.</p>\n<p>3. By doing good and being generous, we are laying up treasure as a firm foundation for the future-and it's being storing up treasure for eternity that we are truly living life.</p>\n<p>When I see money leaving my bank account for my monthly giving-it’s a great moment for myself to check my heart to sense if there is joy in my giving or if there is begrudgingness. Is my hope in wealth or God?<br><br>If I feel stressed about money or annoyed that I “have” to give, I pray for a reorientation of my heart to remember what is eternal and for a grateful heart to God who has provided me ability to produce wealth.</p>\n<p>2 parting thoughts:<br>1. Be generous, there’s no reason you can’t give something every month, even if it’s a dollar-it’s a command and we love Jesus by keeping His commands<br>2. When you see that money leave your bank account, reflect on the state of your heart and pray for God to orient your heart to hope even more fully on Him and to be filled with gratitude.</p>\n<p>As Hue often mentions, God cares more about our will and desire becoming more like Jesus as we see Him, so my prayer is that our giving would be worship-seeing Jesus' worth and giving back a portion of what is due him.</p>\n<p>Father, we invite your kingdom to grow in our hearts as we put our hope in you more fully and develop generous hearts that worship you with our giving.</p>",
            "author": {
                "name": "Asaph Yuan"
            },
            "tags": [
            ],
            "date_published": "2024-10-11T14:20:47-05:00",
            "date_modified": "2024-10-14T15:32:45-05:00"
        }
    ]
}
